# parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
    - [10,13,16,30,33,23]  # P3/8
    - [30,61,62,45,59,119]  # P4/16
    - [116,90,156,198,373,326]  # P5/32

# custom backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2

   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],          # 2
   [-1, 3, eca_layer, [128]],

   [-1, 1, ShuffleNetV2_InvertedResidual, [256, 2]], # 3-P3/8
   [-1, 3, ShuffleNetV2_InvertedResidual, [256, 1]], # 4
   [-1, 3, eca_layer, [256]],                              # 5

   [-1, 1, ShuffleNetV2_InvertedResidual, [512, 2]], # 6-P4/16
   [-1, 7, ShuffleNetV2_InvertedResidual, [512, 1]], # 7
   [-1, 3, eca_layer, [512]],                              # 8

   [-1, 1, ShuffleNetV2_InvertedResidual, [1024, 2]], # 9-P5/32
   [-1, 3, ShuffleNetV2_InvertedResidual, [1024, 1]], # 10
   [-1, 3, eca_layer, [1024]],                              # 11

   [-1, 1, SPPF, [1024, 5]],  # 12
  ]

# YOLOv5 head
head:
  [ [ -1, 1, Conv, [ 512, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 9 ], 1, Concat_bifpn, [ 256, 256 ] ],  # cat backbone P4
    [ -1, 3, C3, [ 512, False ] ],  # 16

    [ -1, 1, Conv, [256, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat_bifpn, [ 128, 128 ] ],  # cat backbone P3
    [ -1, 3, C3, [ 256, False ] ],  # 20 (P3/8-small)

    [ -1, 1, Conv, [ 512, 3, 2 ] ],
    [ [ -1, 9, 17 ], 1, Concat_bifpn, [ 256,256 ] ],  # cat head P4
    [ -1, 3, C3, [ 512, False ] ],  # 23 (P4/16-medium)

    [ -1, 1, Conv, [ 1024, 3, 2 ] ],
    [ [ -1, 12 ], 1, Concat_bifpn, [ 512, 512 ] ],  # cat head P5
    [ -1, 3, C3, [ 1024, False ] ],  # 26 (P5/32-large)

    [ [ 21, 24, 27 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
  ]